Script started on Tue 05 Nov 2013 08:49:51 PM PST
You are currently using 5% (22.9 MiB) of your 488.3 MiB quota.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ d[Kgdb list2
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list2...done.
(gdb) break main
Breakpoint 1 at 0x4005a4: file list2.c, line 15.
(gdb) run foo bar
Starting program: /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list2 foo bar
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).


Breakpoint 1, main (argc=3, argv=0x7fffffffe178) at list2.c:15
15	   for (int argi = 0; argi < 5; ++argi) {
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) pa[Krint argc
$1 = 3
(gdb) print argv
$2 = (char **) 0x7fffffffe178
(gdb) par[K[Krint argv[0]
$3 = 0x7fffffffe428 "/afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list2"
(gdb) print argv[1]
$4 = 0x7fffffffe467 "foo"
(gdb) print argv[2]
$5 = 0x7fffffffe46b "bar"
(gdb) print argv[3]
$6 = 0x0
(gdb) print argv [4][K[K[K[K[4]
$7 = 0x7fffffffe46f "USER=asilva3"
(gdb) print argv[5]
$8 = 0x7fffffffe47c "LOGNAME=asilva3"
(gdb) print argv[6]
$9 = 0x7fffffffe48c "HOME=/afs/cats.ucsc.edu/users/g/asilva3"
(gdb) quit
A debugging session is active.

	Inferior 1 [process 24866] will be killed.

Quit anyway? (y or n) y
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ scrpi[K[Kipt part08
Script started, file is part08
You are currently using 5% (22.9 MiB) of your 488.3 MiB quota.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind -- lea[K[K[Kleak -chea[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kcp list2.c list3.c
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind --leak-check=full \list3 foo bar barz[K[Kz qux
valgrind: list3: command not found
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ quit
quit: Command not found.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ exit
exit
Script done, file is part08
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ clear
[H[2J]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ cp list2.c list3.c
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ script part08
Script started, file is part08
You are currently using 5% (22.9 MiB) of your 488.3 MiB quota.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind --leak-checkl=[K[K=full[K-[K=[K[K[K[K[K=full\list[K[K[K[K list3 foo bar baz qus[Kx
valgrind: foo: command not found
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind -- lea[K[K[Kleak -check = f[Kf[Kfi[Kull \ list foo bar baz qux
valgrind:  list: command not found
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind --leak -check=ful\[K \ list3 foo bar baz qux
valgrind:  list3: command not found
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list.c[K[K3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
list3.c: In function â€˜mainâ€™:
list3.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind --leak-check=ful \[Kl \ list3 foo bar baz qux
valgrind:  list3: command not found
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ val g[Kgrind ==[K[K--leak [Kk-check=full\ [1@0[Pnd [1@ [1@.[1@\[1@u[1@n[1@i[1@n[1@i[1@t --leak-check=full\ [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kvalgind unit[K[K[K[Klist3.c
valgind: Command not found.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind list3.c
valgrind: ./list3.c: Permission denied
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
list3.c: In function â€˜mainâ€™:
list3.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind list3.c
valgrind: ./list3.c: Permission denied
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ ehco[K[K[Kcho #[K$/[K?
126
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ pstatus 13[K[K26[K[K126
pstatus: 0x007E TERMINATED 126: Unknown signal 126
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3/c[K[K[K[K[K[K[K[K[Kls
[0m[01;32mlist1[0m    list2.c  [01;32mmalloc[0m    part01  part04  part07  [01;32muninit[0m
list1.c  [01;32mlist3[0m    malloc.c  part02  part05  part08  uninit.c
[01;32mlist2[0m    list3.c  [01;32mmk[0m        part03  part06  [01;34mRCS[0m
[m]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi list3.c
[?1049h[?1h=[1;43r[?12;25h[?12l[?25h[27m[m[H[2J[?25l[43;1H"list3.c" 27L, 635C[>c[1;1H[34m// $Id: list3.c,v 1.1 2013-11-05 20:54:10-08 - - $[m

[35m#include [m[31m<assert.h>[m
[35m#include [m[31m<stdio.h>[m
[35m#include [m[31m<stdlib.h>[m

[32mtypedef[m [32mstruct[m node node;
[32mstruct[m node {
   [32mchar[m *word;
   node *link;
};

[32mint[m main ([32mint[m argc, [32mchar[m **argv) {
   node *head;
   [33mfor[m ([32mint[m argi = [31m0[m; argi < [31m5[m; ++argi) {[16;6H node *node = malloc ([33msizeof[m ([32mstruct[m node));[17;6H assert (node != [31mNULL[m);[18;6H node->word = argv[argi];[19;6H node->link = head;[20;6H head = node;
   }
   [33mfor[m (node *curr = head; curr->link != [31mNULL[m; curr = curr->link) {[23;6H printf ([31m"[m[35m%p[m[31m->node {word=[m[35m%p[m[31m->[[m[35m%s[m[31m], link=[m[35m%p[m[31m}[m[35m\n[m[31m"[m,[24;14H curr, curr->word, curr->word, curr->link);
   }
   [33mreturn[m [31m9[m;
}
[1m[34m~                                                                                [29;1H~                                                                                [30;1H~                                                                                [31;1H~                                                                                [32;1H~                                                                                [33;1H~                                                                                [34;1H~                                                                                [35;1H~                                                                                [36;1H~                                                                                [37;1H~                                                                                [38;1H~                                                                                [39;1H~                                                                                [40;1H~                                                                                [41;1H~                                                                                [42;1H~                                                                                [m[43;64H1,1[11CAll[1;1H[?12l[?25h[?25l[43;1H[K[43;1H:[?12l[?25hq[?25l[?12l[?25h[?25l[43;1H[K[43;1H[?1l>[?12l[?25h[?1049l]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
list3.c: In function â€˜mainâ€™:
list3.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind list3
==26462== Memcheck, a memory error detector
==26462== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==26462== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==26462== Command: list3
==26462== 
0x4c27180->node {word=0x7ff000456->[HOME=/afs/cats.ucsc.edu/users/g/asilva3], link=0x4c27130}
0x4c27130->node {word=0x7ff000446->[LOGNAME=asilva3], link=0x4c270e0}
0x4c270e0->node {word=0x7ff000439->[USER=asilva3], link=0x4c27090}
0x4c27090->node {word=(nil)->[(null)], link=0x4c27040}
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x400663: main (list3.c:22)
==26462== 
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x3710E45948: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
==26462== Use of uninitialised value of size 8
==26462==    at 0x3710E43D01: _itoa_word (in /lib64/libc-2.12.so)
==26462==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x3710E43D08: _itoa_word (in /lib64/libc-2.12.so)
==26462==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x3710E4697D: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x3710E45385: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
==26462== Conditional jump or move depends on uninitialised value(s)
==26462==    at 0x3710E453FD: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462== 
0x4c27040->node {word=0x7ff000433->[list3], link=0x3710e0fb88}
==26462== Use of uninitialised value of size 8
==26462==    at 0x40065C: main (list3.c:22)
==26462== 
==26462== Use of uninitialised value of size 8
==26462==    at 0x40061E: main (list3.c:23)
==26462== 
==26462== Use of uninitialised value of size 8
==26462==    at 0x400626: main (list3.c:23)
==26462== 
==26462== Use of uninitialised value of size 8
==26462==    at 0x40062D: main (list3.c:23)
==26462== 
==26462== Invalid read of size 1
==26462==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
==26462==  Address 0xc0012000029d5 is not stack'd, malloc'd or (recently) free'd
==26462== 
==26462== 
==26462== Process terminating with default action of signal 11 (SIGSEGV)
==26462==  General Protection Fault
==26462==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==26462==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==26462==    by 0x40064B: main (list3.c:23)
0x3710e0fb88->node {word=0xc0012000029d5->[==26462== 
==26462== HEAP SUMMARY:
==26462==     in use at exit: 80 bytes in 5 blocks
==26462==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==26462== 
==26462== LEAK SUMMARY:
==26462==    definitely lost: 0 bytes in 0 blocks
==26462==    indirectly lost: 0 bytes in 0 blocks
==26462==      possibly lost: 0 bytes in 0 blocks
==26462==    still reachable: 80 bytes in 5 blocks
==26462==         suppressed: 0 bytes in 0 blocks
==26462== Rerun with --leak-check=full to see details of leaked memory
==26462== 
==26462== For counts of detected and suppressed errors, rerun with: -v
==26462== Use --track-origins=yes to see where uninitialised values come from
==26462== ERROR SUMMARY: 54 errors from 12 contexts (suppressed: 6 from 6)
Segmentation fault (core dumped)
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ gdb list3
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3...done.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe437->[HOME=/afs/cats.ucsc.edu/users/g/asilva3], link=0x601070}
0x601070->node {word=0x7fffffffe427->[LOGNAME=asilva3], link=0x601050}
0x601050->node {word=0x7fffffffe41a->[USER=asilva3], link=0x601030}
0x601030->node {word=(nil)->[(null)], link=0x601010}
0x601010->node {word=0x7fffffffe3db->[/afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3], link=0x3710e0fb88}

Program received signal SIGSEGV, Segmentation fault.
0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) where
#0  0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
#1  0x0000003710e4f44a in printf () from /lib64/libc.so.6
#2  0x000000000040064c in main (argc=1, argv=0x7fffffffe138) at list3.c:23
(gdb) list
6	
7	typedef struct node node;
8	struct node {
9	   char *word;
10	   node *link;
11	};
12	
13	int main (int argc, char **argv) {
14	   node *head;
15	   for (int argi = 0; argi < 5; ++argi) {
(gdb) print foo
No symbol "foo" in current context.
(gdb) print pointer
No symbol "pointer" in current context.
(gdb) print *pointer
No symbol "pointer" in current context.
(gdb) print argv[0]
No symbol "argv" in current context.
(gdb) quit
A debugging session is active.

	Inferior 1 [process 26812] will be killed.

Quit anyway? (y or n) y
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3
mk: list3: is not a C source file
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
list3.c: In function â€˜mainâ€™:
list3.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind list3
==28162== Memcheck, a memory error detector
==28162== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==28162== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==28162== Command: list3
==28162== 
0x4c27180->node {word=0x7ff000456->[HOME=/afs/cats.ucsc.edu/users/g/asilva3], link=0x4c27130}
0x4c27130->node {word=0x7ff000446->[LOGNAME=asilva3], link=0x4c270e0}
0x4c270e0->node {word=0x7ff000439->[USER=asilva3], link=0x4c27090}
0x4c27090->node {word=(nil)->[(null)], link=0x4c27040}
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x400663: main (list3.c:22)
==28162== 
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x3710E45948: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
==28162== Use of uninitialised value of size 8
==28162==    at 0x3710E43D01: _itoa_word (in /lib64/libc-2.12.so)
==28162==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x3710E43D08: _itoa_word (in /lib64/libc-2.12.so)
==28162==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x3710E4697D: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x3710E45385: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
==28162== Conditional jump or move depends on uninitialised value(s)
==28162==    at 0x3710E453FD: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162== 
0x4c27040->node {word=0x7ff000433->[list3], link=0x3710e0fb88}
==28162== Use of uninitialised value of size 8
==28162==    at 0x40065C: main (list3.c:22)
==28162== 
==28162== Use of uninitialised value of size 8
==28162==    at 0x40061E: main (list3.c:23)
==28162== 
==28162== Use of uninitialised value of size 8
==28162==    at 0x400626: main (list3.c:23)
==28162== 
==28162== Use of uninitialised value of size 8
==28162==    at 0x40062D: main (list3.c:23)
==28162== 
==28162== Invalid read of size 1
==28162==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
==28162==  Address 0xc0012000029d5 is not stack'd, malloc'd or (recently) free'd
==28162== 
==28162== 
==28162== Process terminating with default action of signal 11 (SIGSEGV)
==28162==  General Protection Fault
==28162==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==28162==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==28162==    by 0x40064B: main (list3.c:23)
0x3710e0fb88->node {word=0xc0012000029d5->[==28162== 
==28162== HEAP SUMMARY:
==28162==     in use at exit: 80 bytes in 5 blocks
==28162==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==28162== 
==28162== LEAK SUMMARY:
==28162==    definitely lost: 0 bytes in 0 blocks
==28162==    indirectly lost: 0 bytes in 0 blocks
==28162==      possibly lost: 0 bytes in 0 blocks
==28162==    still reachable: 80 bytes in 5 blocks
==28162==         suppressed: 0 bytes in 0 blocks
==28162== Rerun with --leak-check=full to see details of leaked memory
==28162== 
==28162== For counts of detected and suppressed errors, rerun with: -v
==28162== Use --track-origins=yes to see where uninitialised values come from
==28162== ERROR SUMMARY: 54 errors from 12 contexts (suppressed: 6 from 6)
Segmentation fault (core dumped)
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ gdb list3
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3...done.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3 
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" does not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug" does not match "/lib64/libm.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug" does not match "/lib64/libc.so.6" (CRC mismatch).

0x601090->node {word=0x7fffffffe437->[HOME=/afs/cats.ucsc.edu/users/g/asilva3], link=0x601070}
0x601070->node {word=0x7fffffffe427->[LOGNAME=asilva3], link=0x601050}
0x601050->node {word=0x7fffffffe41a->[USER=asilva3], link=0x601030}
0x601030->node {word=(nil)->[(null)], link=0x601010}
0x601010->node {word=0x7fffffffe3db->[/afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3], link=0x3710e0fb88}

Program received signal SIGSEGV, Segmentation fault.
0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86_64
(gdb) where
#0  0x0000003710e480ec in vfprintf () from /lib64/libc.so.6
#1  0x0000003710e4f44a in printf () from /lib64/libc.so.6
#2  0x000000000040064c in main (argc=1, argv=0x7fffffffe138) at list3.c:23
(gdb) quit
A debugging session is active.

	Inferior 1 [process 28799] will be killed.

Quit anyway? (y or n) y
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 lab5 [K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[K[Kls
[0m[01;32mlist1[0m    list2.c  [01;32mmalloc[0m    part01  part04  part07  [01;32muninit[0m
list1.c  [01;32mlist3[0m    malloc.c  part02  part05  part08  uninit.c
[01;32mlist2[0m    list3.c  [01;32mmk[0m        part03  part06  [01;34mRCS[0m
[m]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ c[Ksubnmit[K[K[K[Kmit cmps012b=[K-wm.f13 lab5 part01 part02 part03 part05[K4 par t05 part 06 part07

submit: ERROR: nonexistent or unreadable File(s) specified (part 06).
Please specify valid files to submit.

Usage: submit Class.Qtr Assignment Filename...
Usage: submit -m
'submit -m' will display the documentation
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi part06
[?1049h[?1h=[1;43r[?12;25h[?12l[?25h[27m[m[H[2J[?25l[43;1H"part06" [noeol] 525L, 28672C[>c[1;1HScript started on Tue 05 Nov 2013 08:41:01 PM PST
You are currently using 5% (22.9 MiB) of your 488.3 MiB quota.[34m^M
^[[m]0;asilva3@unix1:lab5[34m^G[m[asilva3@unix1 lab5]$ mk list2.c[34m^M^M[m
CSOURCE=list2.c EXECBIN=list2[34m^M[m
+ cid + list2.c[34m^M[m
+ checksource list2.c[34m^M[m
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list2.c -o list2 -lm[34m^M[m
list2.c: In function â€˜mainâ€™:[34m^M[m
list2.c:13: warning: unused parameter â€˜argcâ€™[34m^M[m
+ set +x[34m^M[m
============================================================[34m^M
^[[m]0;asilva3@unix1:lab5[34m^G[m[asilva3@unix1 lab5]$ vi list2.c[34m^M^M
^[[m[?1049h[34m^[[m[?1h[34m^[[m=[34m^[[m[1;43r[34m^[[m[?12;25h[34m^[[m[?12l[34m^[[m[?25h[34m^[[m[27m[34m^[[m[m[34m^[[m[H[34m^[[m[2J[34m^[[m[?25l[34m^[[m[433[14;1H;1H"list2.c" 27L, 635C[34m^[[m[>c[34m^[[m[1;1H[34m^[[m[34m// $Id: list2.c,v 1.1 2013-11-05 20:37:533[15;1H-08 - - $[34m^[[m[m[34m^M
^M
^[[m[35m#include [34m^[[m[m[34m^[[m[31m<assert.h>[34m^[[m[m[34m^M
^[[m[35m#include [34m^[[m[m[34m^[[m[31m<stdio.h>[34m^[[m[m[34m^M
^[[m[35m#include [34m^[[m[m[34m^[[m[31m<stdlib.h>[34m^[[m[m[34m^M
^M
^[[m[32mtypedef[34m^[[m[m [34m^[[m[32mstruct[34m^[[m[m node node;[34m^M
^[[m[32mstruct[34m^[[m[m node {[34m^M[m
   [34m^[[m[32mchar[34m^[[m[m *word;[34m^M[m
   node *link;[34m^M[m
};[34m^M
^M
^[[m[32mint[34m^[[m[m main ([34m^[[m[32mint[34m^[[m[m argc, [34m^[[m[32mchar[34m^[[m[m **argv) {[34m^M[m
   node *head;[34m^M[m
   [34m^[[m[33mfor[34m^[[m[m ([34m^[[m[32mint[34m^[[m[m argi = [34m^[[m[31m0[34m^[[m[m; argi < [34m^[[m[31m5[34m^[[m[m; ++argi) {{[30;1H[34m^[[m[16;6H node *node = malloc ([34m^[[m[33msizeof[34m^[[m[m ([34m^[[m[32mstruct[34m^[[m[m node));[34m^[[m[17;6H  [31;1Hassert (node != [34m^[[m[31mNULL[34m^[[m[m);[34m^[[m[18;6H node->word = argv[argi];[34m^[[m[19;6H node->ll[32;1Hink = head;[34m^[[m[20;6H head = node;[34m^M[m
   }[34m^M[m
   [34m^[[m[33mfor[34m^[[m[m (node *curr = head; curr->link != [34m^[[m[31mNULL[34m^[[m[m; curr = curr->ll[35;1Hink) {[34m^[[m[23;6H printf ([34m^[[m[31m"[34m^[[m[m[34m^[[m[35m%p[34m^[[m[m[34m^[[m[31m->node {word=[34m^[[m[m[34m^[[m[35m%p[34m^[[m[mm[36;1H[34m^[[m[31m->[[34m^[[m[m[34m^[[m[35m%s[34m^[[m[m[34m^[[m[31m], link=[34m^[[m[m[34m^[[m[35m%p[34m^[[m[m[34m^[[m[31m}[34m^[[m[m[34m^[[m[35m\n[34m^[[m[m[34m^[[m[[[37;1H31m"[34m^[[m[m,[34m^[[m[24;14H curr, curr->word, curr->word, curr->link);[34m^M[m
   }[34m^M[m
   [34m^[[m[33mreturn[34m^[[m[m [34m^[[m[31m9[34m^[[m[m;[34m^M[m
}[34m^M
^[[m[1m[34m^[[m[34m~[68C  [42;1H [9C [34m^[[m[29;1H~[41;1H[1m[34m@                                                                                [42;1H@                                                                                [m[43;64H1,1[11CTop[1;1H[?12l[?25h[?25l[43;1H[K[43;1H:[?12l[?25hq[?25l[?12l[?25h[?25l[43;1H[K[43;1H[?1l>[?12l[?25h[?1049l]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm .f13 lab5 part01
Submitting the files you specified...
copying part01

1 File submitted: 
  part01 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 part02

submit: ERROR: missing or incorrect Assignment (part02)
Choose one from:
asg3  asg4  asg5  lab5	lab6  lab7  lab8  lab9

Usage: submit Class.Qtr Assignment Filename...
Usage: submit -m
'submit -m' will display the documentation
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ lab5
lab5: Command not found.
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ sum[Kbmit cmps012b-wm.f13 pa[K[Klab5 part02
Submitting the files you specified...
copying part02

1 File submitted: 
  part02 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ c[Ksubmit cmps012b-wm.f13 p[Klab5 part03
Submitting the files you specified...
copying part03

1 File submitted: 
  part03 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 lab5 part03[K[K[K[K[K[Kpart04
Submitting the files you specified...
copying part04

1 File submitted: 
  part04 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 lab5 part04[K5
Submitting the files you specified...
copying part05

1 File submitted: 
  part05 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 lab5 part0545[K6
Submitting the files you specified...
copying part06

1 File submitted: 
  part06 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ submit cmps012b-wm.f13 lab5 part06[K[K[K[K[K[Klist2.c
Submitting the files you specified...
copying list2\.c

1 File submitted: 
  list2.c (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi pat0[K[Krt07
[?1049h[?1h=[1;43r[?12;25h[?12l[?25h[27m[m[H[2J[?25l[43;1H"part07" [noeol] 513L, 28672C[>c[1;1HScript started on Tue 05 Nov 2013 08:49:51 PM PST
You are currently using 5% (22.9 MiB) of your 488.3 MiB quota.[34m^M
^[[m]0;asilva3@unix1:lab5[34m^G[m[asilva3@unix1 lab5]$ d[34m^H^[[m[Kgdb list2[34m^M^M
^[[m[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)[34m^M[m
Copyright (C) 2010 Free Software Foundation, Inc.[34m^M[m
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>[34m^M[m
This is free software: you are free to change and redistribute it.[34m^M[m
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"[34m^M[m
and "show warranty" for details.[34m^M[m
This GDB was configured as "x86_64-redhat-linux-gnu".[34m^M[m
For bug reporting instructions, please see:[34m^M[m
<http://www.gnu.org/software/gdb/bugs/>...[34m^M[m
Reading symbols from /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/liss[14;1Ht2...done.[34m^M[m
(gdb) break main[34m^M[m
Breakpoint 1 at 0x4005a4: file list2.c, line 15.[34m^M[m
(gdb) run foo bar[34m^M[m
Starting program: /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list2  [19;1Hfoo bar[34m^M[m
warning: the debug information found in "/usr/lib/debug//lib64/ld-2.12.so.debug"  [21;1Hdoes not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).[34m^M
^M[m
warning: the debug information found in "/usr/lib/debug/lib64/ld-2.12.so.debug" dd[24;1Hoes not match "/lib64/ld-linux-x86-64.so.2" (CRC mismatch).[34m^M
^M[m
warning: the debug information found in "/usr/lib/debug//lib64/libm-2.12.so.debugg[27;1H" does not match "/lib64/libm.so.6" (CRC mismatch).[34m^M
^M[m
warning: the debug information found in "/usr/lib/debug/lib64/libm-2.12.so.debug""[30;1H does not match "/lib64/libm.so.6" (CRC mismatch).[34m^M
^M[m
warning: the debug information found in "/usr/lib/debug//lib64/libc-2.12.so.debugg[33;1H" does not match "/lib64/libc.so.6" (CRC mismatch).[34m^M
^M[m
warning: the debug information found in "/usr/lib/debug/lib64/libc-2.12.so.debug""[36;1H does not match "/lib64/libc.so.6" (CRC mismatch).[34m^M
^M
^M[m
Breakpoint 1, main (argc=3, argv=0x7fffffffe178) at list2.c:15[34m^M[m
15[8C for (int argi = 0; argi < 5; ++argi) {[34m^M[m
Missing separate debuginfos, use: debuginfo-install glibc-2.12-1.107.el6_4.4.x86__[42;1H64[34m^M[m[43;64H1,1[11CTop[1;1H[?12l[?25h[?25l[43;64H2[2;1H[?12l[?25h[?25l[43;64H3[3;1H[?12l[?25h[?25l[43;64H4[4;1H[?12l[?25h[?25l[43;64H5[5;1H[?12l[?25h[?25l[43;64H6[6;1H[?12l[?25h[?25l[43;64H7[7;1H[?12l[?25h[?25l[43;64H8[8;1H[?12l[?25h[?25l[43;64H9[9;1H[?12l[?25h[?25l[43;64H10,1[10;1H[?12l[?25h[?25l[43;65H1[11;1H[?12l[?25h[?25l[43;65H2[12;1H[?12l[?25h[?25l[43;65H3[13;1H[?12l[?25h[?25l[80Css[14;1Ht
[46m([mgdb[46m)[m[43;65H4[15;1H[?12l[?25h[?25l(gdb)[43;65H5[16;1H[?12l[?25h[?25l
[46m([mgdb[46m)[m[43;65H6[17;1H[?12l[?25h[?25l(gdb)[43;65H7[18;1H[?12l[?25h[?25l[43;65H8[20;1H[?12l[?25h[?25l[43;65H9[22;1H[?12l[?25h[?25l[43;64H20[23;1H[?12l[?25h[?25l[43;65H1[25;1H[?12l[?25h[?25l[43;65H2[26;1H[?12l[?25h[?25l[43;65H3[28;1H[?12l[?25h[?25l[43;65H4[29;1H[?12l[?25h[?25l[43;65H5[31;1H[?12l[?25h[?25l[43;65H6[32;1H[?12l[?25h[?25l[43;65H7[34;1H[?12l[?25h[?25l[43;65H8[35;1H[?12l[?25h[?25l[43;65H9[37;1H[?12l[?25h[?25l[43;64H30[38;1H[?12l[?25h[?25l[43;65H1[39;1H[?12l[?25h[?25l[43;65H2[40;1H[?12l[?25h[?25l[43;65H3[41;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m pa[34m^H^[[m[Krint argc[34m^M[m[43;1H[K[43;64H34,1[11C0%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$1 = 3[34m^M[m[43;64H[K[43;64H35,1[11C0%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m print argv[34m^M[m[43;64H[K[43;64H36,1[11C0%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$2 = (char **) 0x7fffffffe178[34m^M[m[43;64H[K[43;64H37,1[11C0%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m par[34m^H^[[m[K[34m^H^[[m[Krint argv[0][34m^M[m[43;64H[K[43;64H38,1[11C1%[42;1H[?12l[?25h[?25l[1;42r[1;1H[2M[1;43r[40;1H(gdb)
$3 = 0x7fffffffe428 "/afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/liss[42;1Ht2"[34m^M[m[43;64H[K[43;64H39,1[11C1%[41;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m print argv[1][34m^M[m[43;64H[K[43;64H40,1[11C1%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$4 = 0x7fffffffe467 "foo"[34m^M[m[43;64H[K[43;64H41,1[11C1%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m print argv[2][34m^M[m[43;64H[K[43;64H42,1[11C2%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$5 = 0x7fffffffe46b "bar"[34m^M[m[43;64H[K[43;64H43,1[11C2%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m print argv[3][34m^M[m[43;64H[K[43;64H44,1[11C2%[42;1H[?12l[?25h[?25l[1;42r[1;1H[2M[1;43r[40;1H(gdb)
$6 = 0x0[34m^M[m
(gdb) print argv [4][34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[34m^H^[[m[K[4][34m^M[m[43;64H[K[43;64H45,1[11C2%[41;1H[?12l[?25h[?25l
[46m([mgdb[46m)[m[43;65H6[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$7 = 0x7fffffffe46f "USER=asilva3"[34m^M[m[43;64H[K[43;64H47,1[11C2%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[46m([mgdb[46m)[m print argv[5][34m^M[m[43;64H[K[43;64H48,1[11C3%[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[41;1H(gdb)
$8 = 0x7fffffffe47c "LOGNAME=asilva3"[34m^M[m[43;64H[K[43;64H49,1[11C3%[42;1H[?12l[?25h[?25l[1;42r[1;1H[2M[1;43r[41;1H[46m([mgdb[46m)[m print argv[6][34m^M[m
$9 = 0x7fffffffe48c "HOME=/afs/cats.ucsc.edu/users/g/asilva3"[34m^M[m[43;64H[K[43;64H50,1[11C3%[41;1H[?12l[?25h[?25l(gdb)[43;65H1[42;1H[?12l[?25h[?25l[1;42r[1;1H[2M[1;43r[41;1H[46m([mgdb[46m)[m quit[34m^M[m
A debugging session is active.[34m^M[m[43;64H[K[43;64H52,1[11C3%[41;1H[?12l[?25h[?25l(gdb)[43;65H3[42;1H[?12l[?25h[?25l[1;42r[42;1H
[1;43r[42;1H[34m^M[m[43;64H[K[43;64H54,1[11C3%[42;1H[?12l[?25h[?25l[43;64H[K[43;1H:[?12l[?25hq[?25l[?12l[?25h[?25l[43;1H[K[43;1H[?1l>[?12l[?25h[?1049l]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ sub[K[K[Kvi part07[23Gsubmit cmps012b-wm.f13 lab5 list2.c[51Gpart06[K[51Glist2.c[23Gvi part07[K[23G[Kvi part07[23Gsubmit cmps012b-wm.f13 lab5 list2.c[51Gpart06[K[K7
Submitting the files you specified...
copying part07

1 File submitted: 
  part07 (revision 1)

]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi list3.c
[?1049h[?1h=[1;43r[?12;25h[?12l[?25h[27m[m[H[2J[?25l[43;1H"list3.c" 27L, 635C[>c[1;1H[34m// $Id: list3.c,v 1.1 2013-11-05 20:54:10-08 - - $[m

[35m#include [m[31m<assert.h>[m
[35m#include [m[31m<stdio.h>[m
[35m#include [m[31m<stdlib.h>[m

[32mtypedef[m [32mstruct[m node node;
[32mstruct[m node {
   [32mchar[m *word;
   node *link;
};

[32mint[m main ([32mint[m argc, [32mchar[m **argv) {
   node *head;
   [33mfor[m ([32mint[m argi = [31m0[m; argi < [31m5[m; ++argi) {[16;6H node *node = malloc ([33msizeof[m ([32mstruct[m node));[17;6H assert (node != [31mNULL[m);[18;6H node->word = argv[argi];[19;6H node->link = head;[20;6H head = node;
   }
   [33mfor[m (node *curr = head; curr->link != [31mNULL[m; curr = curr->link) {[23;6H printf ([31m"[m[35m%p[m[31m->node {word=[m[35m%p[m[31m->[[m[35m%s[m[31m], link=[m[35m%p[m[31m}[m[35m\n[m[31m"[m,[24;14H curr, curr->word, curr->word, curr->link);
   }
   [33mreturn[m [31m9[m;
}
[1m[34m~                                                                                [29;1H~                                                                                [30;1H~                                                                                [31;1H~                                                                                [32;1H~                                                                                [33;1H~                                                                                [34;1H~                                                                                [35;1H~                                                                                [36;1H~                                                                                [37;1H~                                                                                [38;1H~                                                                                [39;1H~                                                                                [40;1H~                                                                                [41;1H~                                                                                [42;1H~                                                                                [m[43;64H1,1[11CAll[1;1H[?12l[?25h[?25l[43;64H2,0-1[2;1H[?12l[?25h[?25l[43;64H3,1  [3;1H[?12l[?25h[?25l[43;64H4[4;1H[?12l[?25h[?25l[43;64H5[5;1H[?12l[?25h[?25l[43;64H6,0-1[6;1H[?12l[?25h[?25l[43;64H7,1  [7;1H[?12l[?25h[?25l[43;64H8[8;1H[?12l[?25h[?25l[43;64H9[9;1H[?12l[?25h[?25l[43;64H10,1[10;1H[?12l[?25h[?25l[8;13H[46m{


}[m[43;65H1[11;1H[?12l[?25h[?25l[8;13H{


}[43;65H2,0-1[12;1H[?12l[?25h[?25l[43;65H3,1  [13;1H[?12l[?25h[?25l[43;65H4[14;1H[?12l[?25h[?25l[43;65H5[15;1H[?12l[?25h[?25l[43;65H6[16;1H[?12l[?25h[?25l[43;65H7[17;1H[?12l[?25h[?25l[43;65H8[18;1H[?12l[?25h[?25l[43;65H9[19;1H[?12l[?25h[?25l[43;64H20[20;1H[?12l[?25h[?25l[43;65H1[21;1H[?12l[?25h[?25l[43;65H2[22;1H[?12l[?25h[?25l[43;65H3[23;1H[?12l[?25h[?25l[43;65H4[24;1H[?12l[?25h[?25l[43;65H5[25;1H[?12l[?25h[?25l[43;65H4[24;1H[?12l[?25h[?25l[43;65H5[25;1H[?12l[?25h[?25l[43;67H2[25;2H[?12l[?25h[?25l[43;65H6[26;2H[?12l[?25h[?25l[43;67H3[26;3H[?12l[?25h[?25l[43;65H5[25;3H[?12l[?25h[?25l[22;67H[46m{[25;4H}[m[43;67H4[25;4H[?12l[?25h[?25l[43;1H[1m-- INSERT --[m[43;13H[K[43;64H25,4[10CAll[25;4H[?12l[?25h[?25l[43;67H5[25;5H[?12l[?25h[?25l[26;42r[26;1H[L[1;43r[43;64H[K[43;64H26,1[10CAll[22;67H{[25;4H}
[?12l[?25h[?25l[43;67H2[26;2H[?12l[?25h[?25l[43;67H3[26;3H[?12l[?25h[?25l[43;67H4[26;4H[?12l[?25h[?25l f[43;67H5[26;5H[?12l[?25h[?25lfr[43;67H6[26;6H[?12l[?25h[?25lre[43;67H7[26;7H[?12l[?25h[?25lee[43;67H8[26;8H[?12l[?25h[?25le(

[1m[37m[41m}[m[43;67H9[26;9H[?12l[?25h[?25l(c[43;67H10[26;10H[?12l[?25h[?25lcu[43;68H1[26;11H[?12l[?25h[?25lur[43;68H2[26;12H[?12l[?25h[?25lrr[43;68H3[26;13H[?12l[?25h[?25lr)

}[26;8H[46m([mcurr[46m)[m[43;68H4[26;14H[?12l[?25h[?25l[46m)[m;[26;8H(curr)[43;68H5[26;15H[?12l[?25h[43;1H[K[26;14H[?25l[43;64H26,14[9CAll[26;14H[?12l[?25h[?25l[43;64H[K[43;1H:[?12l[?25hx[?25l[?12l[?25h[?25l"list3.c" 28L, 650C written
[?1l>[?12l[?25h[?1049l]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi list3.c[23Gsubmit cmps012b-wm.f13 lab5 part07[23G[25Pvi[32G[23G[25@submit cmps012b-wm.f13 lab5[57G[23Gvi list3.c[K[23G[Kmk list3
mk: list3: is not a C source file
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ vi list3.c
[?1049h[?1h=[1;43r[?12;25h[?12l[?25h[27m[m[H[2J[?25l[43;1H"list3.c" 28L, 650C[>c[1;1H[34m// $Id: list3.c,v 1.1 2013-11-05 20:54:10-08 - - $[m

[35m#include [m[31m<assert.h>[m
[35m#include [m[31m<stdio.h>[m
[35m#include [m[31m<stdlib.h>[m

[32mtypedef[m [32mstruct[m node node;
[32mstruct[m node {
   [32mchar[m *word;
   node *link;
};

[32mint[m main ([32mint[m argc, [32mchar[m **argv) {
   node *head;
   [33mfor[m ([32mint[m argi = [31m0[m; argi < [31m5[m; ++argi) {[16;6H node *node = malloc ([33msizeof[m ([32mstruct[m node));[17;6H assert (node != [31mNULL[m);[18;6H node->word = argv[argi];[19;6H node->link = head;[20;6H head = node;
   }
   [33mfor[m (node *curr = head; curr->link != [31mNULL[m; curr = curr->link) {[23;6H printf ([31m"[m[35m%p[m[31m->node {word=[m[35m%p[m[31m->[[m[35m%s[m[31m], link=[m[35m%p[m[31m}[m[35m\n[m[31m"[m,[24;14H curr, curr->word, curr->word, curr->link);
   }
   free(curr);
   [33mreturn[m [31m9[m;
}
[1m[34m~                                                                                [30;1H~                                                                                [31;1H~                                                                                [32;1H~                                                                                [33;1H~                                                                                [34;1H~                                                                                [35;1H~                                                                                [36;1H~                                                                                [37;1H~                                                                                [38;1H~                                                                                [39;1H~                                                                                [40;1H~                                                                                [41;1H~                                                                                [42;1H~                                                                                [m[43;64H26,4[10CAll[26;4H[?12l[?25h[?25l[43;1H[K[43;1H:[?12l[?25hq[?25l[?12l[?25h[?25l[43;1H[K[43;1H[?1l>[?12l[?25h[?1049l]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ mk list3.c
CSOURCE=list3.c EXECBIN=list3
+ cid + list3.c
+ checksource list3.c
+ gcc -g -O0 -Wall -Wextra -std=gnu99 list3.c -o list3 -lm
list3.c: In function â€˜mainâ€™:
list3.c:26: error: â€˜currâ€™ undeclared (first use in this function)
list3.c:26: error: (Each undeclared identifier is reported only once
list3.c:26: error: for each function it appears in.)
list3.c:13: warning: unused parameter â€˜argcâ€™
+ set +x
============================================================
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ valgrind uni[K[K[Klist3
==4286== Memcheck, a memory error detector
==4286== Copyright (C) 2002-2012, and GNU GPL'd, by Julian Seward et al.
==4286== Using Valgrind-3.8.1 and LibVEX; rerun with -h for copyright info
==4286== Command: list3
==4286== 
0x4c27180->node {word=0x7ff000456->[HOME=/afs/cats.ucsc.edu/users/g/asilva3], link=0x4c27130}
0x4c27130->node {word=0x7ff000446->[LOGNAME=asilva3], link=0x4c270e0}
0x4c270e0->node {word=0x7ff000439->[USER=asilva3], link=0x4c27090}
0x4c27090->node {word=(nil)->[(null)], link=0x4c27040}
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x400663: main (list3.c:22)
==4286== 
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x3710E45948: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
==4286== Use of uninitialised value of size 8
==4286==    at 0x3710E43D01: _itoa_word (in /lib64/libc-2.12.so)
==4286==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x3710E43D08: _itoa_word (in /lib64/libc-2.12.so)
==4286==    by 0x3710E46912: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x3710E4697D: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x3710E45385: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
==4286== Conditional jump or move depends on uninitialised value(s)
==4286==    at 0x3710E453FD: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286== 
0x4c27040->node {word=0x7ff000433->[list3], link=0x3710e0fb88}
==4286== Use of uninitialised value of size 8
==4286==    at 0x40065C: main (list3.c:22)
==4286== 
==4286== Use of uninitialised value of size 8
==4286==    at 0x40061E: main (list3.c:23)
==4286== 
==4286== Use of uninitialised value of size 8
==4286==    at 0x400626: main (list3.c:23)
==4286== 
==4286== Use of uninitialised value of size 8
==4286==    at 0x40062D: main (list3.c:23)
==4286== 
==4286== Invalid read of size 1
==4286==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
==4286==  Address 0xc0012000029d5 is not stack'd, malloc'd or (recently) free'd
==4286== 
==4286== 
==4286== Process terminating with default action of signal 11 (SIGSEGV)
==4286==  General Protection Fault
==4286==    at 0x3710E480EC: vfprintf (in /lib64/libc-2.12.so)
==4286==    by 0x3710E4F449: printf (in /lib64/libc-2.12.so)
==4286==    by 0x40064B: main (list3.c:23)
0x3710e0fb88->node {word=0xc0012000029d5->[==4286== 
==4286== HEAP SUMMARY:
==4286==     in use at exit: 80 bytes in 5 blocks
==4286==   total heap usage: 5 allocs, 0 frees, 80 bytes allocated
==4286== 
==4286== LEAK SUMMARY:
==4286==    definitely lost: 0 bytes in 0 blocks
==4286==    indirectly lost: 0 bytes in 0 blocks
==4286==      possibly lost: 0 bytes in 0 blocks
==4286==    still reachable: 80 bytes in 5 blocks
==4286==         suppressed: 0 bytes in 0 blocks
==4286== Rerun with --leak-check=full to see details of leaked memory
==4286== 
==4286== For counts of detected and suppressed errors, rerun with: -v
==4286== Use --track-origins=yes to see where uninitialised values come from
==4286== ERROR SUMMARY: 54 errors from 12 contexts (suppressed: 6 from 6)
Segmentation fault (core dumped)
]0;asilva3@unix1:lab5[asilva3@unix1 lab5]$ echo [K[K[K[Kgdb list2[K3
[?1034hGNU gdb (GDB) Red Hat Enterprise Linux (7.2-60.el6_4.1)
Copyright (C) 2010 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-redhat-linux-gnu".
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>...
Reading symbols from /afs/cats.ucsc.edu/users/g/asilva3/private/cmps012b/lab5/list3...done.
(gdb) run
Starting program: /afs/cats.ucsc.edu/users/g